src/main/resources/xml/accommodationSalesServicePort/fulFillPurchaseRequest/fulFillPurchaseRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sal="http://sales.accommodation.transferobject.booking.dreams.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <sal:fulFillPurchaseRequest>
         <pointsPurchaseRequest>
            <purchaseDate>?</purchaseDate>
            <purchaseValue>?</purchaseValue>
            <!--Optional:-->
            <purchasedPointType>?</purchasedPointType>
            <!--Optional:-->
            <productCode>?</productCode>
            <!--Optional:-->
            <productName>?</productName>
            <fulfillmentDate>?</fulfillmentDate>
            <travelPlanId>?</travelPlanId>
            <!--Optional:-->
            <overriddenErrors>?</overriddenErrors>
            <useMonth>?</useMonth>
            <purchaseFor>
               <membershipId>?</membershipId>
               <facility>
                  <!--Optional:-->
                  <enterpriseFacilityId>?</enterpriseFacilityId>
                  <resortCode>?</resortCode>
                  <resortType>?</resortType>
               </facility>
               <contractIdentifier>
                  <!--Optional:-->
                  <contractId>?</contractId>
                  <contractSequence>?</contractSequence>
               </contractIdentifier>
            </purchaseFor>
            <!--Zero or more repetitions:-->
            <purchaseFroms>
               <membershipId>?</membershipId>
               <facility>
                  <!--Optional:-->
                  <enterpriseFacilityId>?</enterpriseFacilityId>
                  <resortCode>?</resortCode>
                  <resortType>?</resortType>
               </facility>
               <contractIdentifier>
                  <!--Optional:-->
                  <contractId>?</contractId>
                  <contractSequence>?</contractSequence>
               </contractIdentifier>
            </purchaseFroms>
         </pointsPurchaseRequest>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </sal:fulFillPurchaseRequest>
   </soapenv:Body>
</soapenv:Envelope>
